app/Http/Controllers/admin.php

select `nomUtilisateur` from `utilisateurs` where `isAdministrateur` = 1
---
    public function listeUtilisateur()
    {
        $listeUtilisateur = utilisateur::select('idUtilisateur','nomUtilisateur','nom','prenom','mail','motDePasseUtilisateur','motDePasseOublie')->where('isAdministrateur', '=', false)->get();

delete from `parkings` where `idParking` = '6'
---
    public function deleteplace()
    {
        $action = 4;
        $id = $_POST['id'];
        parking::where('idParking','=', $_POST['idParking'])->delete();