app/Http/Controllers/admin.php

    public function listeattente()
    {
        $utilisateursFileAttente = reservation::join('utilisateurs','idUtilisateur','=','utilisateur')->select('idReservation','nomUtilisateur', 'positionFileAttente')->where('positionFileAttente','>', 0)->get();
---
select `idReservation`, `utilisateur`, `positionFileAttente` from `reservations` where `positionFileAttente` > 0

    public function listeUtilisateur()
    {
        $listeUtilisateur = utilisateur::select('idUtilisateur','nomUtilisateur','nom','prenom','mail','motDePasseUtilisateur','motDePasseOublie')->where('isAdministrateur', '=', false)->get();
---
select `idUtilisateur`, `nomUtilisateur`, `nom`, `prenom`, `mail`, `motDePasseUtilisateur`, `motDePasseOublie` from `utilisateurs` where `isAdministrateur` = 0

    public function demandesinscriptions()
    {
        $utilisateurNonInscrits = utilisateur::select('idUtilisateur','nomUtilisateur','nom','prenom','mail','motDePasseUtilisateur')->where('estInscrit', '=', false)->get();
---
select `idUtilisateur`, `nomUtilisateur`, `nom`, `prenom`, `mail`, `motDePasseUtilisateur` from `utilisateurs` where `estInscrit` = 0

    public function accepterinscription($idUtilisateur)
    {
        utilisateur::where('idUtilisateur','=',$idUtilisateur)->update(array('estInscrit' => true));
        $utilisateurNonInscrits = utilisateur::select('idUtilisateur','nomUtilisateur','nom','prenom','mail','motDePasseUtilisateur')->where('estInscrit', '=', false)->get();
---
update `utilisateurs` set `estInscrit` = 1, `utilisateurs`.`updated_at` = '2021-03-01 12:27:15' where `idUtilisateur` = '4'
select `idUtilisateur`, `nomUtilisateur`, `nom`, `prenom`, `mail`, `motDePasseUtilisateur` from `utilisateurs` where `estInscrit` = 0

    public function accepterToutesLesInscriptions()
    {
        utilisateur::where('estInscrit','=',false)->update(array('estInscrit' => true));
        $utilisateurNonInscrits = utilisateur::select('idUtilisateur','nomUtilisateur','nom','prenom','mail','motDePasseUtilisateur')->where('estInscrit', '=', false)->get();
---
select `idUtilisateur`, `nomUtilisateur`, `nom`, `prenom`, `mail`, `motDePasseUtilisateur` from `utilisateurs` where `estInscrit` = 0

    public function refuserinscription($idUtilisateur)
    {
        utilisateur::where('idUtilisateur','=',$idUtilisateur)->delete();
---
delete from `utilisateurs` where `idUtilisateur` = 'ListeAttente'

    public function histoattributionplace()
    {
        $listeHistoReservation = reservation::join('utilisateurs','reservations.utilisateur','=','idUtilisateur')->select('idReservation','positionFileAttente','numeroPlace','etatReservation','dateDebut','dateFin','nomUtilisateur')->get();
---
select `positionFileAttente` from `reservations` where `idReservation` <> '4' and `positionFileAttente` > 0 order by `positionFileAttente` asc

    public function updateFileAttente(Request $request,$idReservation)
    {
        $placeAattribuer= $request->input('placeAattribuer');
        $request = reservation::select('positionFileAttente')->where('idReservation','=', $idReservation)->get();
        foreach($request as $key => $value)
        {
            if($value->positionFileAttente > $placeAattribuer)
                reservation::where('positionFileAttente','>=', $placeAattribuer)->increment('positionFileAttente');
            else
            reservation::where('positionFileAttente','<=', $placeAattribuer)->decrement('positionFileAttente');
        }
        reservation::where('idReservation','=',$idReservation)->update(array('positionFileAttente' => $placeAattribuer));
        $utilisateursFileAttente = reservation::select('idReservation','utilisateur', 'positionFileAttente')->where('positionFileAttente','>', 0)->get();
---
select `positionFileAttente` from `reservations` where `idReservation` <> '4' and `positionFileAttente` > 0 order by `positionFileAttente` asc
update `reservations` set `positionFileAttente` = `positionFileAttente` - 1, `reservations`.`updated_at` = '2021-03-06 17:28:31' where `positionFileAttente` <= '3'
select `positionFileAttente` from `reservations` where `idReservation` = '4'

    public function test()
    {
        $date = new DateTime();
        $placesLibres = parking::leftJoin('reservations', 'reservations.numeroPlace','=','parkings.numeroPlace')->
                          select('parkings.numeroPlace')->where('dateFin','<', $date->format('Y-m-d'))
                                                        ->orWhere('etatReservation','=', 1)->distinct()->get();
---
select distinct `parkings`.`numeroPlace` from `parkings` left join `reservations` on `reservations`.`numeroPlace` = `parkings`.`numeroPlace` where `dateFin` < '2021-02-27' or `etatReservation` = 1