app/Http/Controllers/admin.php

    public function histoattributionplace()
    {
        $listeHistoReservation = reservation::join('utilisateurs','reservations.utilisateur','=','idUtilisateur')->select('idReservation','positionFileAttente','numeroPlace','etatReservation','dateDebut','dateFin','nomUtilisateur')->get();
---
select `idReservation`, `utilisateur`, `positionFileAttente` from `reservations` where `positionFileAttente` > 0

    public function updateFileAttente(Request $request,$idReservation)
    {
        $placeAattribuer= $request->input('placeAattribuer');
        $request = reservation::select('positionFileAttente')->where('idReservation','=', $idReservation)->get();
        foreach($request as $key => $value)
        {
            if($value->positionFileAttente >$placeAattribuer)
                reservation::where('positionFileAttente','>=', $placeAattribuer)->increment('positionFileAttente');
---
update `reservations` set `positionFileAttente` = '7', `reservations`.`updated_at` = '2021-02-26 17:30:40' where `idReservation` = '4'

    public function show($idReservation)
    {
        $reservation = reservation::select('*')->where('idReservation','=', $idReservation)->get();
---
select * from `reservations` where `idReservation` = '4'