app/Http/Controllers/connexion.php

select * from `utilisateurs` where `nomUtilisateur` = 'HugoAraujooooo'
---
    public function connexion()
    {
        $utilisateur = null;
        $id = null;
        $motdepasse = null;
        $admin = null;
        $error = 0;
        $user = $_POST['user'];
        $pswd = $_POST['pswd'];
        $connect = utilisateur::select('*')->where('nomUtilisateur', '=', $user)->get();

select max(`idUtilisateur`) as aggregate from `utilisateurs`
insert into `utilisateurs` (`idUtilisateur`, `nomUtilisateur`, `nom`, `prenom`, `mail`, `motDePasseUtilisateur`, `isAdministrateur`) values (14, 'JOJOMASQUEADVENTURE', 'JOJO', 'BIZARRE', 'jojopasaventure@gmail.com', 'jojopasbizarreaventure', 0)
---
    public function inscriptionexe()
    {
        $verif = utilisateur::select('*')->get();
        $error = 0;
        foreach ($verif as $verifdata) {
            if ($verifdata -> nomUtilisateur == $_GET['user']) {
                $error = 1;
            }
            if ($verifdata -> mail == $_GET['mail']) {
                $error = 2;
            }
        }
        if ($_GET['password'] != $_GET['newpassword']) {
            $error = 3;
        }
        if ($error == 0) {
            $error = 4;
            $max = DB::table('utilisateurs')->max('idUtilisateur');
            $max++;
            $inscription = DB::table('utilisateurs')->insert([
                'idUtilisateur' => $max,
                'nomUtilisateur' => $_GET['user'],
                'nom' => $_GET['nom'],
                'prenom' => $_GET['prenom'],
                'mail' => $_GET['mail'],
                'motDePasseUtilisateur' => Hash::make($_GET['password']),
                'isAdministrateur' => false,
            ]);

update `utilisateurs` set `motDePasseOublie` = 1, `utilisateurs`.`updated_at` = '2021-03-01 13:48:05' where `mail` = 'laTourInfernale@hotmail.com'
---
    public function reinitialisemdp()
    {
        $error = 2;
        $verif = utilisateur::select('mail')->where('isAdministrateur','=',false)->get();
        foreach ($verif as $verifdata) {
            if ($verifdata->mail == $_GET['email']) {
                $error = 3;
            }
        }
        if ($error == 3) {
            $error = 5;
            utilisateur::where('mail', '=',$_GET['email'])->update(array('motDePasseOublie' => true));