app/Http/Controllers/user.php

select * from `utilisateurs` where `idUtilisateur` = '13'
select count(*) as aggregate from `reservations` where `utilisateur` = 13
---
    public function reservation()
    {
        $requete = utilisateur::select('*')->where('idUtilisateur', '=',$_POST['id'])->get();
        foreach ($requete as $requetedata) {
            $id = $requetedata -> idUtilisateur;
            $nom = $requetedata -> nom;
            $prenom = $requetedata -> prenom;
        }
        $info = array(
            0 => $id,
            1 => $nom,
            2 => $prenom,
        );

        $reservation = reservation::select('idReservation')->where('utilisateur', '=', $info[0])->count();

update `reservations` set `etatReservation` = 1, `reservations`.`updated_at` = '2021-03-03 11:36:15' where `idReservation` = '23'
---
    public function annule()
    {
        $annule = reservation::
        where('idReservation', '=', $_POST['id'])
        ->update(['etatReservation' => 1]);

select * from `utilisateurs` where `idUtilisateur` = '10'
---
    public function formMDP()
    {
        $requete = utilisateur::select('*')->where('idUtilisateur', '=',$_POST['id'])->get();

select `motDePasseUtilisateur` from `utilisateurs` where `idUtilisateur` = '10'
---
    public function confirmMDP()
    {

        $action = 2;
        $user = array(
            0 => $_POST['iduser'],
            1 => 0,
        );
        $connect = utilisateur::select('motDePasseUtilisateur')->where('idUtilisateur', '=', $user[0])->get();

select distinct `parkings`.`numeroPlace` from `parkings` left join `reservations` on `reservations`.`numeroPlace` = `parkings`.`numeroPlace` where `dateFin` < '2021-02-28' or `etatReservation` = 1
select max(`idReservation`) as aggregate from `reservations`
select max(`positionFileAttente`) as aggregate from `reservations`
insert into `reservations` (`idReservation`, `positionFileAttente`, `numeroPlace`, `utilisateur`, `etatReservation`, `dateDebut`, `dateFin`) values (27, 15, '3A', '10', 0, '2021-02-28', '2021-03-31')
---
    public function ReservationExe()
    {
        $action = 1;
        $id = $_POST['iduser'];
        $date = new DateTime();
        $placesLibres = parking::leftJoin('reservations', 'reservations.numeroPlace','=','parkings.idParking')->
                          select('parkings.idParking')->where('dateFin','<', $date->format('Y-m-d'))
                                                        ->orWhere('etatReservation','=', 1)->distinct()->get();
        $nbPlacesLibres = count($placesLibres);
        $max = reservation::select('idReservation')->max('idReservation') + 1;
        $attente = reservation::select('positionFIleAttente')->max('positionFileAttente') + 1;
        if ($nbPlacesLibres >= 0) {
            $nbPlacesLibres--;
            $input = rand(0, $nbPlacesLibres);
            // $nbplace = $placesLibres[$input];
            // $nbplace = explode('"', $nbplace);
            // $nbplace = $nbplace[3];
            $datedebut = date('Y-m-d');
            $datefin = date('Y-m-t', strtotime('+1 month'));
            $requete = reservation::insert([
                'idReservation' => $max,
                'positionFileAttente' => null,
                'numeroPlace' => $input,
                'utilisateur' => $id,
                'etatReservation' => 0,
                'dateDebut' => $datedebut,
                'dateFin' => $datefin,
            ]);

select max(`idReservation`) as aggregate from `reservations`
---
                'dateFin' => NULL,
            ]);
        }
        $max = reservation::select('idReservation')->max('idReservation');