app/Http/Controllers/user.php

select * from `reservations` left join `parkings` on `idParking` = `reservations`.`numeroPlace` where `utilisateur` = 13
---
    public function reservation()
    {
        $requete = utilisateur::select('*')->where('idUtilisateur', '=', $_POST['id'])->get();
        foreach ($requete as $requetedata) {
            $id = $requetedata->idUtilisateur;
            $nom = $requetedata->nom;
            $prenom = $requetedata->prenom;
        }
        $info = array(
            0 => $id,
            1 => $nom,
            2 => $prenom,
        );

        $reservation = reservation::select('idReservation')->where('utilisateur', '=', $info[0])->count();

        $dbreserv = array(
            0 => 0,
            1 => null,
        );

        if ($reservation == 0) {
            $dbreserv[0] = 1;
        }

        $dbreserv[1] = reservation::leftJoin('parkings', 'idParking', '=', 'reservations.numeroPlace')->select('*')->where('utilisateur', '=', $info)->get();